Revit 2024 API
IPipeFittingAndAccessoryPressureDropUIServer Interface
 Interface for external servers providing optional UI for pipe fitting and pipe accessory coefficient calculation.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public interface IPipeFittingAndAccessoryPressureDropUIServer : IExternalServer
Visual Basic
Public Interface IPipeFittingAndAccessoryPressureDropUIServer _
	Inherits IExternalServer
Visual C++
public interface class IPipeFittingAndAccessoryPressureDropUIServer : IExternalServer
Remarks
 This service works with pipe fitting and accessory pressure drop service. It provides the settings for the pipe fitting and accessory pressure drop server if needed; and it also provides UI for user to input the settings in Revit. A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service.
See Also
IPipeFittingAndAccessoryPressureDropUIServer Members
Autodesk.Revit.UI.Plumbing Namespace